       PROGRAM-ID. InventFileConverter.
       AUTHOR. RIFAT SHAMS.
       DATE-WRITTEN. 14 APRIL 2018

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INVENT-FILE-IN
               ASSIGN TO
               "INVENT.TXT"
               ORGANIZATION IS LINE SEQUENTIAL.

           SELECT INVENT-FILE-INDEXED-OUT 
               ASSIGN TO
               "INVENT6.TXT"
               ORGANIZATION IS INDEXED
               ACCESS IS  SEQUENTIAL
               RECORD KEY IS INDEXED-PART-NUMBER-OUT.
       
           SELECT ERROR-FILE-OUT 
               ASSIGN TO
               "INVENTERROR.TXT"
               ORGANIZATION IS LINE SEQUENTIAL.


       CONFIGURATION SECTION.

       DATA DIVISION.
       FILE SECTION.
       FD  INVENT-FILE-IN
           RECORD CONTAINS 40 CHARACTERS.
       01  INVENT-RECORD-IN.
           05  PART-NUMBER-IN             PIC 9(5).
           05  INVENT-REST-OF-RECORD-IN   PIC X(35).
           
       FD   INVENT-FILE-INDEXED-OUT
            RECORD CONTAINS 40 CHARACTERS.
       01   INDEXED-RECORD-OUT.
            05 INDEXED-PART-NUMBER-OUT  PIC 9(5).
            05 INDEXED-REST-OF-RECORD-OUT   PIC X(35).
       
       FD ERROR-FILE-OUT
          RECORD CONTAINS 40 CHARACTERS.
       01 ERROR-RECORD-OUT.   
          05 PART-NUMBER-ERROR-OUT PIC X(5).
          05 REST-OF-ERROR-RECORD-OUT  PIC X(35).

     
       WORKING-STORAGE SECTION.
       01  EOF-FLAG          PIC A(3).
     
       PROCEDURE DIVISION.
       100-CONVERT-INVENT-FILE.
           PERFORM 200-INITIATE-CONVERT-FILE.
           PERFORM 200-PROCESS-INVENT-RECORD
               UNTIL EOF-FLAG="YES".
           PERFORM 200-TERM-CONVERT-JOB.
           STOP RUN.

       200-INITIATE-CONVERT-FILE.
           PERFORM 700-OPEN-FILES.
           PERFORM 700-READ-INVENT-RECORD.
       
       200-TERM-CONVERT-JOB.
           CLOSE INVENT-FILE-IN.
           CLOSE INVENT-FILE-INDEXED-OUT.
           CLOSE ERROR-FILE-OUT.

       200-PROCESS-INVENT-RECORD.
           PERFORM 700-PROCESS-SEQUENTIAL-RECORD.
           PERFORM 700-READ-INVENT-RECORD.
           
       700-OPEN-FILES.
           OPEN INPUT INVENT-FILE-IN.
           OPEN OUTPUT INVENT-FILE-INDEXED-OUT.
           OPEN OUTPUT ERROR-FILE-OUT.
       
       700-READ-INVENT-RECORD.
           READ INVENT-FILE-IN
               AT END MOVE "YES" TO EOF-FLAG.
       
       700-PROCESS-SEQUENTIAL-RECORD.
           MOVE PART-NUMBER-IN TO INDEXED-PART-NUMBER-OUT.
           MOVE INVENT-REST-OF-RECORD-IN TO INDEXED-REST-OF-RECORD-OUT.
           WRITE INDEXED-RECORD-OUT
               INVALID KEY PERFORM 900-WRITE-ERROR
           END-WRITE.
       
       900-WRITE-ERROR.
           MOVE PART-NUMBER-IN TO PART-NUMBER-ERROR-OUT.
           MOVE INVENT-REST-OF-RECORD-IN TO REST-OF-ERROR-RECORD-OUT.
           WRITE ERROR-RECORD-OUT.