       PROGRAM-ID. SupplierFileConverter.
       AUTHOR. RIFAT SHAMS.
       DATE-WRITTEN. 14 APRIL 2018

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT SUPPLIER-FILE-IN
               ASSIGN TO
               "SUPPLIERS1.TXT"
               ORGANIZATION IS LINE SEQUENTIAL.

           SELECT SUPPLIER-FILE-INDEXED-OUT 
               ASSIGN TO
               "SUPPLIERI6.TXT"
               ORGANIZATION IS INDEXED
               ACCESS IS  SEQUENTIAL
               RECORD KEY IS INDEXED-SUPPLIER-CODE-OUT.
       
           SELECT ERROR-FILE-OUT 
               ASSIGN TO
               "SUPPLIERERROR.TXT"
               ORGANIZATION IS LINE SEQUENTIAL.


       CONFIGURATION SECTION.

       DATA DIVISION.
       FILE SECTION.
       FD  SUPPLIER-FILE-IN
           RECORD CONTAINS 20 CHARACTERS.
       01  SUPPLIER-RECORD-IN.
           05  SUPPLIER-CODE-IN    PIC X(5).
           05  REST-OF-RECORD-IN   PIC X(15).

       FD   SUPPLIER-FILE-INDEXED-OUT
            RECORD CONTAINS 20 CHARACTERS.
       01   INDEXED-RECORD-OUT.
            05 INDEXED-SUPPLIER-CODE-OUT  PIC 9(5).
            05 INDEXED-REST-OF-RECORD-OUT PIC X(15).
       
       FD ERROR-FILE-OUT
          RECORD CONTAINS 20 CHARACTERS.
       01 ERROR-RECORD-OUT.   
          05 SUPPLIER-CODE-ERROR-OUT PIC X(5).
          05 REST-OF-ERROR-RECORD-OUT PIC X(35).

     
       WORKING-STORAGE SECTION.
       01  EOF-FLAG          PIC A(3).
     
       PROCEDURE DIVISION.
       100-CONVERT-INVENT-FILE.
           PERFORM 200-INITIATE-CONVERT-FILE.
           PERFORM 200-PROCESS-SUPPLIER-RECORD
               UNTIL EOF-FLAG="YES".
           PERFORM 200-TERM-CONVERT-JOB.
           STOP RUN.

       200-INITIATE-CONVERT-FILE.
           PERFORM 700-OPEN-FILES.
           PERFORM 700-READ-SUPPLIER-RECORD.
       
       200-TERM-CONVERT-JOB.
           CLOSE SUPPLIER-FILE-IN.
           CLOSE SUPPLIER-FILE-INDEXED-OUT.
           CLOSE ERROR-FILE-OUT.

       200-PROCESS-SUPPLIER-RECORD.
           PERFORM 700-PROCESS-SEQUENTIAL-RECORD.
           PERFORM 700-READ-SUPPLIER-RECORD.
           
       700-OPEN-FILES.
           OPEN INPUT SUPPLIER-FILE-IN.
           OPEN OUTPUT SUPPLIER-FILE-INDEXED-OUT.
           OPEN OUTPUT ERROR-FILE-OUT.
       
       700-READ-SUPPLIER-RECORD.
           READ SUPPLIER-FILE-IN
               AT END MOVE "YES" TO EOF-FLAG.
       
       700-PROCESS-SEQUENTIAL-RECORD.
           MOVE SUPPLIER-CODE-IN TO INDEXED-SUPPLIER-CODE-OUT.
           MOVE REST-OF-RECORD-IN TO INDEXED-REST-OF-RECORD-OUT.
           WRITE INDEXED-RECORD-OUT
               INVALID KEY PERFORM 900-WRITE-ERROR
           END-WRITE.
       
       900-WRITE-ERROR.
           MOVE SUPPLIER-CODE-IN TO SUPPLIER-CODE-ERROR-OUT.
           MOVE REST-OF-RECORD-IN TO REST-OF-ERROR-RECORD-OUT.
           WRITE ERROR-RECORD-OUT.